<?php
// Запрещено непосредственное исполнение этого скрипта
if(count(get_included_files()) == 1)	die('<b>ERROR:</b> Direct execution forbidden!');



/**
 * Функции формализации и публикации записей
 */



/**
 * Функция нормирования дат
 */
function prepublish_date(&$raw, &$date_norm){
	if(empty($raw['date'])){
		$raw['date_from']	= '1914-08-01';
		$raw['date_to']		= '1918-11-11';
		return;
	}

	// Автоматическая корректировка «машинных» форматов дат в привычные для людей
	$raw['date'] = strtr($raw['date'], array(
		'-Jan-'	=> ' янв.',		'-Feb-'	=> ' фев.',		'-Mar-'	=> ' мар.',		'-Apr-'	=> ' апр.',		'-May-'	=> ' мая ',
		'-Jun-'	=> ' июн.',		'-Jul-'	=> ' июл.',		'-Aug-'	=> ' авг.',		'-Sep-'	=> ' сен.',		'-Oct-'	=> ' окт.',
		'-Nov-'	=> ' ноя.',		'-Dec-'	=> ' дек.',
	));
	//
	static $month_names_norm = array(
		1	=> ' янв.',		2	=> ' фев.',		3	=> ' мар.',		4	=> ' апр.',		5	=> ' мая ', 	6	=> ' июн.',
		7	=> ' июл.',		8	=> ' авг.',		9	=> ' сен.',		10	=> ' окт.',		11	=> ' ноя.',		12	=> ' дек.',
	);
	// yyyy-mm-dd
	$raw['date'] = preg_replace_callback('/^(\d{4})-(\d{2})-(\d{2})$/uS', function($matches) use ($month_names_norm) {
		if(!isset($month_names_norm[intval($matches[2])]))
			return $matches[0];
		return $matches[3] . $month_names_norm[intval($matches[2])] . $matches[1];
	}, $raw['date']);
	// mm/dd/yyyy
	$raw['date'] = preg_replace_callback('/^(\d{1,2})\/(\d{1,2})\/(\d{2,4})$/uS', function($matches) use ($month_names_norm) {
		if(!isset($month_names_norm[intval($matches[1])]))
			return $matches[0];
		return $matches[2] . $month_names_norm[intval($matches[1])] . $matches[3];
	}, $raw['date']);
	// dd.mm.yyyy
	$raw['date'] = preg_replace_callback('/^(\d{1,2})\.(\d{1,2})\.(\d{2,4})$/uS', function($matches) use ($month_names_norm) {
		if(!isset($month_names_norm[intval($matches[2])]))
			return $matches[0];
		return $matches[1] . $month_names_norm[intval($matches[2])] . $matches[3];
	}, $raw['date']);

	$date_norm = $raw['date'];

	// Переводим все буквы в строчные, обрезаем концевые пробелы и корректируем русские буквы
	$date_norm = fix_russian(trim(mb_strtolower($date_norm)));
	// Убираем префикс «с »
	$date_norm = preg_replace('/^съ?\s*/uS', '', $date_norm);
	// Заменяем частички « по » и « на » на дефис
	$date_norm = preg_replace('/(?<=[\d\W])\s*(?:по|на)\s*(?=[\d\W])/uS', '-', $date_norm);
	// Заменяем частички « и » и « или » на запятую
	$date_norm = preg_replace('/(?<=[\d\W])\s*и(ли)?\s*(?=[\d\W])/uS', ',', $date_norm);
	// Убираем окончание «г[ода][.]»
	$date_norm = preg_replace('/\s*г(?:ода?)?\.?\s*$/uS', '', $date_norm);
	// Заменяем на точки пробелы рядом со словами, остальные — убираем
	$date_norm = preg_replace('/(?<=[А-Яа-я])\s+|\s+(?=[А-Яа-я])/uS', '.', $date_norm);
	$date_norm = preg_replace('/\s+/uS', '', $date_norm);
	// Сокращаем несколько точек или дефисов в один
	$date_norm = preg_replace('/([\.\-])\\1*/uS', '\\1', $date_norm);

	// Шаблоны для поиска дат
	static	$month_names = array(
		'январь'	=> '01',		'января'	=> '01',		'янв'	=> '01',
		'февраль'	=> '02',		'февраля'	=> '02',		'февр'	=> '02',		'фев'	=> '02',		'фвр'	=> '02',
		'март'		=> '03',		'марта'		=> '03',		'мрт'	=> '03',		'мар'	=> '03',
		'апрель'	=> '04',		'апреля'	=> '04',		'апр'	=> '04',
		'май'		=> '05',		'мая'		=> '05',
		'июнь'		=> '06',		'июня'		=> '06',		'июн'	=> '06',
		'июль'		=> '07',		'июля'		=> '07',		'июл'	=> '07',
		'август'	=> '08',		'августа'	=> '08',		'ав'	=> '08',		'авг'	=> '08',
		'сентябрь'	=> '09',		'сентября'	=> '09',		'сен'	=> '09',		'снт'	=> '09',		'сент'	=> '09',
		'октябрь'	=> '10',		'октября'	=> '10',		'окт'	=> '10',
		'ноябрь'	=> '11',		'ноября'	=> '11',		'нбр'	=> '11',		'ноя'	=> '11',		'нояб'	=> '11',
		'декабрь'	=> '12',		'декабря'	=> '12',		'дек'	=> '12',		'дкб'	=> '12',
	);
	static	$reg_months = '';
	static	$reg_date_left	= '';
	static	$reg_date_right	= '';
	if(empty($reg_months)){
		$reg_months = '(?:' . implode('|', array_keys($month_names)) . ')';
		// дд[.мм[.[гг]гг]] или дд[.ммм[.[гг]гг]]
		$reg_date_left	= "(\d\d?)(?:\.(?:($reg_months|\d\d?)(?:\.((?:\d\d)?\d\d)?)?)?)?";
		// [[дд.]мм.]гггг или [[дд.]ммм.]гггг
		$reg_date_right	= "(?:(?:(?:(\d\d?)?\.)?($reg_months|\d\d?))?\.)?(\d\d\d\d)";
		// [дд.]ммм.
		$reg_date_right_short	= "(?:(\d\d?)?\.)?($reg_months)\.?()";
	}

	// Запись «1914/15»
	if($date_norm == '1914/15'){
		$matches = array('', '01', '08', '1914', '31', '12', '1915');

	// Простая запись дд.мм.гггг или мм.гггг или гггг
	}elseif(preg_match("/^$reg_date_left$/uS", $date_norm, $matches)
	|| preg_match("/^$reg_date_right$/uS", $date_norm, $matches)){
		if(empty($matches[3]))	$matches[3] = ($matches[2] >= 8 ? 1914 : 1915);
		$matches[4] = $matches[1];
		$matches[5] = $matches[2];
		$matches[6] = $matches[3];

	// Периодическая запись дд-дд.мм.гггг или дд.мм-дд.мм.гггг или дд.мм.гггг-дд.мм.гггг
	}elseif(preg_match("/^$reg_date_left-$reg_date_left$/uS", $date_norm, $matches)
	|| preg_match("/^$reg_date_left-$reg_date_right$/uS", $date_norm, $matches)
	|| preg_match("/^$reg_date_right-$reg_date_right$/uS", $date_norm, $matches)){
		if(empty($matches[6]))	$matches[6] = ($matches[5] >= 8 ? 1914 : 1915);
		if(empty($matches[2]))	$matches[2] = $matches[5];
		if(empty($matches[3]))	$matches[3] = $matches[6];

	// Периодическая запись дд.ммм-дд.ммм.гггг
	}elseif(preg_match("/^$reg_date_right_short-$reg_date_right$/uS", $date_norm, $matches)){
		if(empty($matches[6]))	$matches[6] = ($matches[5] >= 8 ? 1914 : 1915);
		if(empty($matches[2]))	$matches[2] = $matches[5];
		if(empty($matches[3]))	$matches[3] = $matches[6];

	// Списочная запись дд,дд,дд.мм.гггг
	}elseif(preg_match("/^(\d\d?),(?:\d\d?,)*$reg_date_left$/uS", $date_norm, $matches)
	|| preg_match("/^(\d\d?),(?:\d\d?,)*$reg_date_right$/uS", $date_norm, $matches)){
		if(empty($matches[4]))	$matches[4] = ($matches[3] >= 8 ? 1914 : 1915);
		array_splice($matches, 2, 0, array($matches[3], $matches[4]));
	}

	// Нормализуем данные и формируем новые поля
	if(!empty($matches)){
		static $last_days = array(31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31);

		if($matches[3] < 100)	$matches[3] += 1900;
		if(empty($matches[2]))	$matches[2] = ($matches[3] == 1914 ? '08' : '01');
		elseif(!is_numeric($matches[2]))	$matches[2] = $month_names[$matches[2]];
		if(empty($matches[1]))	$matches[1] = '01';
		$tmp = date_create(implode('-', array($matches[3], $matches[2], $matches[1])));
		if($tmp)
			$raw['date_from'] = $tmp->format('Y-m-d');
		//
		if($matches[6] < 100)	$matches[6] += 1900;
		if(empty($matches[5]))	$matches[5] = ($matches[5] == 1918 ? '11' : '12');
		elseif(!is_numeric($matches[5]))	$matches[5] = $month_names[$matches[5]];
		if(empty($matches[4]))	$matches[4] = (($matches[6] == 1918) && ($matches[5] == 11) ? '11' : $last_days[intval($matches[5])-1]);
		$tmp = date_create(implode('-', array($matches[6], $matches[5], $matches[4])));
		if($tmp)
			$raw['date_to'] = $tmp->format('Y-m-d');
		
		if(($raw['date_from'] < '1914-07-01') || ($raw['date_from'] > '1920-12-31')
		|| ($raw['date_to'] < '1914-07-01') || ($raw['date_to'] > '1920-12-31')){
			unset($raw['date_from']);
			unset($raw['date_to']);
		}
	}
// var_export($matches);
}



/**
 * Функция нормирования исходных данных
 */
function prepublish($raw, &$have_trouble, &$date_norm){
	static	$str_fields = array('surname', 'name', 'rank', 'religion', 'marital', 'uyezd', 'reason');

	foreach($str_fields as $key){
		// Убираем концевые пробелы и сокращаем множественные пробелы
		$raw[$key] = trim(preg_replace('/\s\s+/uS', ' ', $raw[$key]));

		// Конвертируем старо-русские буквы в современные
		$raw[$key] = fix_russian($raw[$key]);

		// Правим регистр букв в текстах
		if($key == 'surname'){
			// Первые буквы каждого слова в верхний регистр
			$raw[$key] = preg_replace_callback('/\b\w+\b/uS', function ($matches){
				return mb_ucfirst(mb_strtolower($matches[0]));
			}, $raw[$key]);
		}elseif($key == 'name'){
			// Первые буквы каждого слова в верхний регистр
			$raw[$key] = preg_replace_callback('/\b\w+(?:-\w+)\b/uS', function ($matches){
				return mb_ucfirst($matches[0]);
			}, $raw[$key]);
		}else{
			// Первую букву в верхний регистр
			$raw[$key] = mb_ucfirst($raw[$key]);
		}
	}

	// Расшифровываем вероисповедания
	/** @var	int[]	Array of correspondences between contractions of religion names and their IDs in the database. */
	static	$religion_conts = array();
	//
	// Fetch religion names and reductions from dbase
	if (empty($religion_conts)) {
		$religion_conts[''] = 18;	// Special ID for "(not set)"

		$query = 'SELECT `id`, `religion`, `contractions` FROM `dic_religion` WHERE `religion` NOT LIKE "(%"';
		$result = db_query($query);	/* @var $result mysqli_result */
		while ($row = $result->fetch_object()) {
			$tmp = array_merge((array) mb_strtolower($row->religion), preg_split('/\W+/uS', mb_strtolower($row->contractions), -1, PREG_SPLIT_NO_EMPTY));
			foreach ($tmp as $key) {
				$religion_conts[$key] = $row->id;
			}
		}
		$result->free();
	}
 	//
	$tmp = trim(preg_replace('/\W+/uS', '-', mb_strtolower($raw['religion'])), '-');
// if(defined('P_DEBUG'))	var_export($tmp);
	if(isset($religion_conts[$tmp]))
		$raw['religion_id'] = $religion_conts[$tmp];

	// Расшифровываем семейные положения
	static $maritals = array(
		''		=> 4,
		// Женатые
		'ж'	=> 1,
		'жен'	=> 1,
		'женат'	=> 1,
		'женатъ'	=> 1,
		// Холостые
		'х'	=> 2,
		'хол'	=> 2,
		'холост'	=> 2,
		'холостъ'	=> 2,
		// Вдовые
		'вд'	=> 3,
		'вдв'	=> 3,
		'вдов'	=> 3,
		'вдовъ'	=> 3,
		'вдовец'	=> 3,
	);
	$tmp = trim(preg_replace('/\W+/uS', ' ', mb_strtolower($raw['marital'])));
// if(defined('P_DEBUG'))	var_export($tmp);
	if(isset($maritals[$tmp]))
		$raw['marital_id'] = $maritals[$tmp];

	// Формализуем причины выбытия
	static $reasons = array(
		''	=> 1,						'(?) ранен'	=> 28,
		'(?) ум. от ран'	=> 42,		'(дефект страницы)'	=> 2,
		'(нет данных)'	=> 1,			'(ранен?)'	=> 28,							'. убит.'	=> 38,
		'23 марта возвр. в бат.'	=> 6,
		'paн.'	=> 28,					'paнен'	=> 28,								'pан., ост. на п.с.'	=> 31,
		'б/ вести пропал'	=> 3,		'б/вести проп./убит'	=> 3,				'б/вести пропал'	=> 3,
		'беж.'	=> 8,					'бежал'	=> 8,								'без в пр.'	=> 3,
		'без в. п.'	=> 3,				'без в. пр'	=> 3,							'без в. пр.'	=> 3,
		'без в. проп.'	=> 3,			'без в. пропал'	=> 3,						'без в.пр.'	=> 3,
		'без в.пропал'	=> 3,			'без вести пр.'	=> 3,						'без вести пропал'	=> 3,
		'без вести пропал.'	=> 3,		'без. в пр.'	=> 3,						'без. в. п.'	=> 3,
		'без. в. пр.'	=> 3,			'без. пр.'	=> 3,							'без. проп.'	=> 3,
		'без.в. пр.'	=> 3,			'без.пр'	=> 3,							'безв .пр'	=> 3,
		'безв в. пр.'	=> 3,			'безв пр'	=> 3,							'безв пр.'	=> 3,
		'безв прр'	=> 3,				'безв. пр'	=> 3,							'безв. пр. (ранен)'	=> 3,
		'безв. пр.'	=> 3,				'безв. пр.?'	=> 3,						'безв..пр'	=> 3,
		'безв.пр'	=> 3,				'безв.пр.'	=> 3,							'безв.пр.(ран.)'	=> 3,
		'безв.пр.?'	=> 3,				'безвести пропал'	=> 3,					'безвъв. пр.'	=> 3,
		'безъ в. пр.'	=> 3,			'безъ в.пр.'	=> 3,						'безъ в?сти пропалъ'	=> 3,
		'безъ вести пропалъ'	=> 3,	'безъ.в.пр.'	=> 3,						'безъв пр.'	=> 3,
		'безъв. пр.'	=> 3,			'безъв.'	=> 3,							'безъв.пр.'	=> 3,
		'бов.пр'	=> 3,				'бол. отпр. в госп.'	=> 9,				'бол.'	=> 9,
		'болен'	=> 9,					'болен.'	=> 9,							'больн.'	=> 9,
		'больной'	=> 9,				'был засыпан землей, но освобожден'	=> 4,	'в бег.'	=> 8,
		'в пл'	=> 5,					'в пл.'	=> 5,								'в пл+ну'	=> 5,
		'в плен'	=> 5,				'в плен.'	=> 5,							'в плену (ранен)'	=> 30,
		'в плену ран.'	=> 30,			'в плену расстр.'	=> 7,					'в плену'	=> 5,
		'в плену.'	=> 5,				'в плену.ранен'	=> 30,						'в. бег.'	=> 8,
		'в. пл.'	=> 5,				'в.пл'	=> 5,								'ве пл.'	=> 5,
		'вез в. пр.'	=> 3,			'вез. в. пр.'	=> 3,						'взят в плен ранен'	=> 30,
		'взят в плен'	=> 5,			'въ пл.'	=> 5,
		'въ пл?ну'	=> 5,				'заб. от газа, ост. в строю'	=> 22,		'забол. от газа'	=> 21,
		'забол.'	=> 9,				'заболел от газа'	=> 21,					'заболел от газов'	=> 21,
		'заболел'	=> 21,				'заболел.'	=> 9,							'замерз'	=> 10,
		'захвачен в плен'	=> 5,		'к. в стр.'	=> 14,							'к. о. в стр.'	=> 14,
		'к. ост. в стр.'	=> 14,		'кан.'	=> 11,								'кон. и ран. ост. в стр.'	=> 12,
		'кон. ост. в строю.'	=> 14,	'кон. ост. въ строю'	=> 14,				'кон.ост в строю'	=> 14,
		'кон.ост.в строю'	=> 14,		'кон.ост.на поле сраж.'	=> 13,				'конт о в стр'	=> 14,
		'конт ост в строю'	=> 14,		'конт'	=> 11,								'конт, ост. в строю'	=> 14,
		'конт, сот. в строю'	=> 14,	'конт,ост. в стр.'	=> 14,					'конт,ост. в строю'	=> 14,
		'конт. и ран.'	=> 29,			'конт. легк. ост. в стр.'	=> 14,			'конт. ост в строю'	=> 14,
		'конт. ост в. стр.'	=> 14,		'конт. ост. в полку'	=> 14,				'конт. ост. в ст.'	=> 14,
		'конт. ост. в стр.'	=> 14,		'конт. ост. в строю'	=> 14,				'конт. ост. в строю.'	=> 14,
		'конт. ост. в. стр.'	=> 14,	'конт. ост. на п. с.'	=> 13,				'конт. ост. на поле ср.'	=> 13,
		'конт. остал. на п. с.'	=> 13,	'конт. остался в строю'	=> 14,				'конт. отпр. в лазар.'	=> 11,
		'конт. с лиш. ума'	=> 11,		'конт.'	=> 11,								'конт., верн. в строй'	=> 14,
		'конт., ост. в стр.'	=> 14,	'конт., ост. в строю'	=> 14,				'конт., ост. на п. с.'	=> 13,
		'конт., ост. на п.сраж.'	=> 13,		'конт., ост. на поле ср.'	=> 13,	'конт., ост.в строю'	=> 14,
		'конт., остался в строю'	=> 14,		'конт., отсавлен в строю'	=> 14,	'конт.,ост. в строю'	=> 14,
		'конт.ост в строю'	=> 14,		'конт.ост. в стр.'	=> 14,					'конт.ост.в стр.'	=> 14,
		'конт.ост.в строю'	=> 14,		'конт.ост.на поле ср.'	=> 13,				'конт/ост в строю'	=> 14,
		'контуж ост.стр.'	=> 14,		'контуж'	=> 11,							'контуж. ост. в стр.'	=> 14,
		'контуж. ост. в строю'	=> 14,	'контуж.'	=> 11,							'контуж., ост. в стр.'	=> 14,
		'контуж., ост. в строю'	=> 14,	'контуж., ост. на п. сраж.'	=> 13,			'контуж., ост. при бат.'	=> 14,
		'контуж.,ост.в строю'	=> 14,	'контуж.ост.в.ст.'	=> 14,					'контужен (оглушен)'	=> 11,
		'контужен в ногу'	=> 11,		'контужен и ранен'	=> 29,					'контужен ост. в строю'	=> 14,
		'контужен'	=> 11,				'контужен, ост в строю'	=> 14,				'контужен, ост. в строю'	=> 14,
		'контужен, ост. в. строю'	=> 14,	'контужен, ост. на поле боя'	=> 13,	'контужен, ост.в строю'	=> 14,
		'контужен, ост.в.строю'	=> 14,		'контужен, ост.на поле боя'	=> 13,		'контужен, остался в стою'	=> 14,
		'контужен, остался в строю'	=> 14,	'контужен, остался на целе ср.'	=> 13,	'контуженъ'	=> 11,
		'контуженъ, остался въ строю'	=> 14,			'л. ран.'	=> 15,			'л. ран., ост. в стр.'	=> 15,
		'л. ранен'	=> 15,				'л.ран.'	=> 15,							'лег.ушиб лошад.'	=> 46,
		'легко ранен'	=> 15,			'легко ушибл. лошадью'	=> 46,				'н. случ.'	=> 16,
		'напор. на свой шт.'	=> 16,	'нах. в строю,ран.'	=> 32,					'не известно'	=> 1,
		'неизв'	=> 1,					'нес. сл.'	=> 16,							'несч. случ.'	=> 16,
		'оcт. на п. с.'	=> 20,			'обож.'	=> 17,								'обожж.'	=> 17,
		'обожжен'	=> 17,				'обожжен.'	=> 17,							'огл. оруд. выстрелом.'	=> 18,
		'оглуш. разор. снар.'	=> 18,	'оглуш.'	=> 18,							'оглушен снарядом'	=> 18,
		'оглушен'	=> 18,				'оглушен, ост. в стр.'	=> 19,				'ос на п ср'	=> 20,
		'ос на п.ср'	=> 20,			'ос на поле'	=> 20,						'ос поле ср'	=> 20,
		'ос. на п. с.'	=> 20,			'ос. на п. ср.'	=> 20,						'ос. на п.с.'	=> 20,
		'ос. на п.с., ранен'	=> 31,	'ос. на поле сражения'	=> 20,				'ос. на ц. с.'	=> 20,
		'ос. нап. ср.'	=> 20,			'ос.на п.с.'	=> 20,						'ос.на п.ср'	=> 20,
		'ос.на п.ср.'	=> 20,			'ос.на п.сраж'	=> 20,						'ос.на поле .ср'	=> 20,
		'ост на п. ср.'	=> 20,			'ост на п.с.'	=> 20,						'ост на поле ср.'	=> 20,
		'ост на поле сраж.'	=> 20,		'ост на поле'	=> 20,						'ост па поле'	=> 20,
		'ост поле ср'	=> 20,			'ост. в п.'	=> 20,							'ост. в стр. конт.'	=> 14,
		'ост. в стр. ран.'	=> 32,		'ост. в стр. ранен'	=> 32,					'ост. в стр., конт.'	=> 14,
		'ост. в стр., ранен'	=> 32,	'ост. в стр.контуж.'	=> 14,				'ост. в строю конт.'	=> 14,
		'ост. в строю ран.'	=> 32,		'ост. в строю, ранен'	=> 32,
		'ост. в строю.ран.'	=> 32,		'ост. нa п. cраж.'	=> 20,
		'ост. на п. битвы'	=> 20,		'ост. на п. с.'	=> 20,						'ост. на п. ср.'	=> 20,
		'ост. на п. сраж.'	=> 20,		'ост. на п. сражения'	=> 20,				'ост. на п.с.'	=> 20,
		'ост. на п.ср.'	=> 20,			'ост. на п.сражения'	=> 20,				'ост. на перепр. ч. р. неман.'	=> 20,
		'ост. на пол ср.'	=> 20,		'ост. на пол. ср.'	=> 20,					'ост. на пол. сраж.'	=> 20,
		'ост. на поле боя'	=> 20,		'ост. на поле ср. р.'	=> 20,				'ост. на поле ср.'	=> 20,
		'ост. на поле сраж.'	=> 20,	'ост. на поле страж.'	=> 20,				'ост. на п-с.'	=> 20,
		'ост. на. поле сраж.'	=> 20,	'ост. нан. с.'	=> 20,						'ост. нап с.'	=> 20,
		'ост. нап. с'	=> 20,			'ост. нап. с.'	=> 20,						'ост. нап-е'	=> 20,
		'ост. нап-с.'	=> 20,			'ост.в стр. ранен'	=> 32,					'ост.в стр.кон.'	=> 14,
		'ост.в стр.конт.'	=> 14,		'ост.в стр.-конт.'	=> 14,					'ост.в стр.контуж.'	=> 14,
		'ост.в стр.-ран'	=> 32,		'ост.в стр.ран.'	=> 32,					'ост.в стр.-ран.'	=> 32,
		'ост.в стр.ранен'	=> 32,		'ост.в стр.ранен.'	=> 32,					'ост.в строю.конт.'	=> 14,
		'ост.в строю.ран.'	=> 32,		'ост.в строю.ранен'	=> 32,					'ост.в строю-ран.'	=> 32,
		'ост.в.стр.контуж.'	=> 14,		'ост.в.стр.ранен'	=> 32,					'ост.в.строю.ран.'	=> 32,
		'ост.на п. ср.'	=> 20,			'ост.на п.с.'	=> 20,						'ост.на п.ср'	=> 20,
		'ост.на п.ср.'	=> 20,			'ост.на п.сраж.'	=> 20,					'ост.на пол ср.ранен'	=> 31,
		'ост.на пол.ср.'	=> 20,		'ост.на пол.ср.ран.'	=> 31,				'ост.на пол.ср.ранен'	=> 31,
		'ост.на пол? сраж.'	=> 20,		'ост.на поле боя'	=> 20,					'ост.на поле ср.'	=> 20,
		'ост.на поле ср.,ран.'	=> 31,	'ост.на поле ср.ран.'	=> 31,				'ост.на поле ср.ранен'	=> 31,
		'ост.на поле сраж.'	=> 20,		'ост.нап.с.'	=> 20,						'оставлен на поле сраж.'	=> 20,
		'оставлен на поле сражения'	=> 20,	'оставлен на поле стражения'	=> 20,	'остал. на п. ср.'	=> 20,
		'остал. на поле ср.'	=> 20,	'остал. на поле сраж.'	=> 20,				'остал.в стр.ранен'	=> 31,
		'остал.на поле ср.'	=> 20,		'остал.на поле сраж.'	=> 20,				'остался на п. сраж.'	=> 20,
		'остался на п.сраж.'	=> 20,	'остался на п/сраж.'	=> 20,				'остался на поле боя'	=> 20,
		'остался на поле сраж.'	=> 20,	'остался на поле сражения'	=> 20,			'остался на поле стражения'	=> 20,
		'от конт. оглох'	=> 18,		'отмороз. ноги'	=> 10,						'отр. газ. и ост. в строю'	=> 22,
		'отр. газ.'	=> 21,				'отр. газами, остался в стою'	=> 22,		'отр. газом'	=> 21,
		'отр. уд. т.'	=> 21,			'отр.газ. ост. в стр.'	=> 22,				'отр.газ.'	=> 21,
		'отравлен газами'	=> 21,		'отравлен газом'	=> 21,					'отравлен газом, ост. в строю'	=> 22,
		'отс. в п.'	=> 23,				'отст. в пох.'	=> 23,						'отст.'	=> 23,
		'отстал в походе'	=> 23,		'отстал в пути'	=> 23,						'отстал'	=> 23,
		'отстал.'	=> 23,				
		'пер.к.п.'	=> 24,				'переб к прот'	=> 24,						'пог. в во вр. вож.'	=> 34,
		'пог. в зем. во время пож.'	=> 34,	'пог. в. зем. во врем. пож.'	=> 34,	'погиб в землянке'	=> 40,
		'пом. лош.'	=> 26,				'помят л.'	=> 26,							'помят лошадьми'	=> 26,
		'помят ящ.'	=> 26,				'помят'	=> 26,
		'пранен'	=> 28,				'пред.зем.'	=> 4,							'при пер. на воз. попал под кол.'	=> 26,
		'прибыл из плена'	=> 6,		'причина не указана'	=> 1,				'пропал б\вести'	=> 3,
		'пропал без вести'	=> 3,		'р. о. в стр.'	=> 32,						'р. о. на п. с.'	=> 31,
		'р. о. на п. ср.'	=> 31,		'р. о. п. ср.'	=> 31,						'р. ост. в стр.'	=> 32,
		'р. ост. на п. с.'	=> 31,		'р. ост. на п. сражения'	=> 31,			'р., ост/на поле сраж.'	=> 31,
		'р./ост в строю'	=> 32,		'р./ост на п/ср.'	=> 31,					'р.о. на п.с.'	=> 31,
		'р.о.п.ср.'	=> 31,				'р.ост.на поле сраж.'	=> 31,				'р/без вести/пр'	=> 3,
		'р/ост на п/сражения'	=> 31,	'радз. колес. заряд. ящ.'	=> 26,			'радз.колес.патр.двук.'	=> 26,
		'раен'	=> 28,					'разбился'	=> 27,							'разд.заряд'	=> 26,
		'раздав? поездом'	=> 26,		'ран ос на поле ср.'	=> 31,				'ран ос на поле'	=> 31,
		'ран ос поле'	=> 31,			'ран ост в строю'	=> 32,					'ран ост на п'	=> 31,
		'ран ост на поле сраж'	=> 31,	'ран ост на поле сраж.'	=> 31,				'ран ост поле ср'	=> 31,
		'ран'	=> 28,					'ран, ост. в строю'	=> 32,					'ран, ост. на п. с.'	=> 31,
		'ран, ост. на п. ср.'	=> 31,	'ран, ост. на поле сражения'	=> 31,		'ран,ост. в стр.'	=> 32,
		'ран,ост. в строю'	=> 32,		'ран,ост. на п. с.'	=> 31,					'ран,ост. на п. ср.'	=> 31,
		'ран,ост. на п.ср.'	=> 31,		'ран. и кон.'	=> 29,						'ран. и конт.'	=> 29,
		'ран. и контужен'	=> 29,		'ран. легк.'	=> 15,						'ран. нах. в строю'	=> 32,
		'ран. ост в стр.'	=> 32,		'ран. ост на пл. ср.'	=> 31,				'ран. ост на поле ср.'	=> 31,
		'ран. ост. в стр.'	=> 32,		'ран. ост. в строю'	=> 32,					'ран. ост. в строю.'	=> 32,
		'ран. ост. на п. с.'	=> 31,	'ран. ост. на п. ср.'	=> 31,				'ран. ост. на п. сраж.'	=> 31,
		'ран. ост. на поле ср.'	=> 31,	'ран. ост. на поле сраж'	=> 31,			'ран. ост. на поле сраж.'	=> 31,
		'ран. ост. на полесраж.'	=> 31,	'ран. ост. поле ср.'	=> 31,			'ран. ост.в стр.'	=> 32,
		'ран. ост.в строю'	=> 32,		'ран. ост.на поле сраж.'	=> 31,			'ран. тяж.'	=> 37,
		'ран.'	=> 28,					'ран., ост. в плену'	=> 30,				'ран., ост. в ст.'	=> 32,
		'ран., ост. в стр.'	=> 32,		'ран., ост. в строю'	=> 32,				'ран., ост. н/п сраж.'	=> 31,
		'ран., ост. на п. с.'	=> 31,	'ран., ост. на п. ср.'	=> 31,				'ран., ост. на п. сраж.'	=> 31,
		'ран., ост. на п.с.'	=> 31,	'ран., ост. на п.ср.'	=> 31,				'ран., ост. на п.сраж.'	=> 31,
		'ран., ост. на п/сраж.'	=> 31,	'ран., ост. на пол. ср.'	=> 31,			'ран., ост. на поле ср.'	=> 31,
		'ран., ост.в строю'	=> 32,		'ран., ост.на п.сраж.'	=> 31,				'ран., ост.на п/сраж.'	=> 31,
		'ран., ост.на поле сраж.'	=> 31,	'ран., уб., в пл. или безв. пр.'	=> 1,	'ран.,ост. в строю'	=> 32,
		'ран.,ост.в стр.'	=> 32,		'ран.взят в плен'	=> 30,					'ран.о.сстр'	=> 32,
		'ран.ос на п.с.'	=> 31,		'ран.ос. в строю'	=> 32,					'ран.ост в стою'	=> 32,
		'ран.ост в стр'	=> 32,			'ран.ост в строю'	=> 32,					'ран.ост. в стр.'	=> 32,
		'ран.ост. в строю.'	=> 32,		'ран.ост. на поле боя'	=> 31,				'ран.ост. на поле ср.'	=> 31,
		'ран.ост.в строю'	=> 32,		'ран.ост.на поле ср.'	=> 31,				'ран.ост.на поле сраж.'	=> 31,
		'ран.ост.на поле страж.'	=> 31,	'ран.ост.на поле.сраж.'	=> 31,			'ран.плен.'	=> 30,
		'ран/ост в строю'	=> 32,		'ран/ост на поле сраж.'	=> 31,				'ран/остался в строю'	=> 32,
		'ранен в плену'	=> 30,			'ранен взят в плен'	=> 30,					'ранен выздор.'	=> 28,
		'ранен и без. в. пр.'	=> 3,	'ранен и конт.'	=> 29,						'ранен и контуж.'	=> 29,
		'ранен и контужен'	=> 29,		'ранен и ост. на п. ср.'	=> 31,			'ранен и ост.в строю'	=> 32,
		'ранен и оставл. на поле сраж.'	=> 31,	'ранен ост в строю'	=> 32,			'ранен ост на поле ср.'	=> 31,
		'ранен ост. в плену'	=> 30,	'ранен ост. в ст.'	=> 32,					'ранен ост. в стр.'	=> 32,
		'ранен ост. в строю'	=> 32,	'ранен ост. в строю.'	=> 32,				'ранен ост. на п. с.'	=> 31,
		'ранен ост. на п. ср.'	=> 31,	'ранен ост. на п. сраж.'	=> 31,			'ранен ост. на поле ср.'	=> 31,
		'ранен ост. на поле сраж'	=> 31,	'ранен ост. на поле сраж.'	=> 31,		'ранен ост.в строю'	=> 32,
		'ранен ост.в.строю'	=> 32,		'ранен ост.на поле сраж.'	=> 31,			'ранен оставлен на поле сраж.'	=> 31,
		'ранен остался в строю'	=> 32,	'ранен'	=> 28,								'ранен, безв. пр.'	=> 3,
		'ранен, в плену'	=> 30,		'ранен, взят в плен'	=> 30,				'ранен, возвр. в строй'	=> 32,
		'ранен, ост в строю'	=> 32,	'ранен, ост. в стр.'	=> 32,				'ранен, ост. в строю'	=> 32,
		'ранен, ост. на п. ср.'	=> 31,	'ранен, ост. на п. сраж.'	=> 31,			'ранен, ост. на п.сраж.'	=> 31,
		'ранен, ост. на поле боя'	=> 31,	'ранен, ост. на поле ср.'	=> 31,		'ранен, ост. на поле сраж.'	=> 31,
		'ранен, ост. на поле сражения'	=> 31,	'ранен, ост.в строю'	=> 32,		'ранен, ост.в.строю'	=> 32,
		'ранен, ост.на п.ср.'	=> 31,	'ранен, ост.на поле боя'	=> 31,			'ранен, остался в строю'	=> 32,
		'ранен, остался на поле боя'	=> 31,	'ранен, остался на поле сражения'	=> 31,	'ранен,контужен'	=> 29,
		'ранен,утонул в реке'	=> 45,	'ранен. ос. на. п. с.'	=> 31,				'ранен. ост в строю'	=> 32,
		'ранен. ост. на поле ср.'	=> 31,	'ранен.'	=> 28,						'раненъ и контуженъ'	=> 29,
		'раненъ'	=> 28,				'раненъ, остался въ строю'	=> 32,			'ранне'	=> 28,
		'сам. отл.'	=> 8,							'самоуб.'	=> 33,
		'сдался в плен'	=> 24,			'слом. ногу'	=> 25,						'слом.ногу'	=> 25,
		'сошел с ума'	=> 35,			'т. ран'	=> 37,							'т. ран.'	=> 37,
		'т. ранен'	=> 37,				'травм. п.'	=> 36,							'травм. поврежд.'	=> 36,
		'травм. повреждение'	=> 36,	'травмат. поврежд.'	=> 36,					'тяж.ран.'	=> 37,
		'тяжело ран.'	=> 37,			'тяжело ранен'	=> 37,						'у'	=> 38,
		'у. от р.'	=> 42,				'у.м отр.'	=> 42,							'уб. или в плену.'	=> 39,
		'убиг'	=> 38,					'убит'	=> 38,								'убит.'	=> 38,
		'убитъ'	=> 38,					'убить'	=> 38,								'увеч.'	=> 36,
		'увечье'	=> 36,				'ум от бол'	=> 41,							'ум от р'	=> 42,
		'ум от ран'	=> 42,				'ум. oт б.'	=> 41,							'ум. от p.'	=> 42,
		'ум. от б.'	=> 41,				'ум. от бол.'	=> 41,						'ум. от р.'	=> 42,
		'ум. от разр. сел.'	=> 42,		'ум. от ран'	=> 42,						'ум. от ран.'	=> 42,
		'ум. от ранения'	=> 42,		'ум. от. бол.'	=> 41,						'ум. от. р.'	=> 42,
		'ум. от. ран'	=> 42,			'ум. от. ран.'	=> 42,						'ум. от.р.'	=> 42,
		'ум. отер.'	=> 42,				'ум. отъ р.'	=> 42,						'ум. отър.'	=> 42,
		'ум. по бол.'	=> 41,			'ум.от б.'	=> 41,							'ум.от б-ни'	=> 41,
		'ум.от бол.'	=> 41,			'ум.от брюшн/тифа'	=> 41,					'ум.от р.'	=> 42,
		'ум.от ран'	=> 42,				'ум.от ран.'	=> 42,						'ум.отъ р.'	=> 41,
		'ум.по бол.'	=> 41,			'умер ост. на поле ср.'	=> 43,				'умер от б.'	=> 41,
		'умер от б-ни'	=> 41,			'умер от бол.'	=> 41,						'умер от болезни'	=> 41,
		'умер от бр. тифа'	=> 41,		'умер от желуч.заб.'	=> 41,				'умер от о.(?)'	=> 40,
		'умер от р.'	=> 42,			'умер от ран и б-ни'	=> 42,				'умер от ран серд.'	=> 42,
		'умер от ран'	=> 42,			'умер от ранений'	=> 42,					'умер от тубер.'	=> 41,
		'умер от х.'	=> 41,			'умер от'	=> 40,							'умер'	=> 40,
		'умер.'	=> 40,					'умеръ отъ ранъ'	=> 42,					'умеръ'	=> 40,
		'упал с лош.слом.ногу'	=> 44,	'утон'	=> 45,								'утон.'	=> 45,
		'утонул'	=> 45,				'утонул.'	=> 45,							'уш. ноги'	=> 46,
		'ушиб'	=> 46,					'ушиб.'	=> 46,								'ушибл.'	=> 46,
		'ушиблен лошадьми'	=> 46,		'ушиблен'	=> 46,							'ушиблен, ост. в стр.'	=> 47,
		'эвак. по болезни'	=> 9,		'явился из плена'	=> 6,					'пропал бвести'	=> 3,
	);
	$tmp = trim(mb_strtolower($raw['reason']));
// if(defined('P_DEBUG'))	var_export($tmp);
	if(isset($reasons[$tmp]))
		$raw['reason_id'] = $reasons[$tmp];

	// Расшифровываем источники
	if(empty($raw['list_nr'])){
		$raw['source_id'] = 0;
	}else{
		$db = db_open();
		$stmt = $db->prepare('SELECT id FROM dic_source WHERE source LIKE ?');
		$tmp = "Именной список №${raw['list_nr']} %";
		$stmt->bind_param("s", $tmp);
		$stmt->execute();
		$stmt->bind_result($res);
		$stmt->fetch();
		$stmt->close();
		if($res)
			$raw['source_id'] = $res;
		else{
			$stmt = $db->prepare('INSERT INTO dic_source (source) VALUES (?)');
			$tmp = "Именной список №${raw['list_nr']} убитым, раненым и без вести пропавшим " . ($raw['list_nr'] < 974 ? "нижним чинам." : "солдатам.");
			$stmt->bind_param("s", $tmp);
			$stmt->execute();
			$stmt->close();
			$raw['source_id'] = $db->insert_id;
		}
	}
	
	// Уточняем региональную привязку
	if(!empty($raw['uyezd'])){
		$db = db_open();
		$stmt = $db->prepare('SELECT id FROM dic_region WHERE parent_id = ? AND title LIKE ?');
		$tmp = $raw['uyezd'] . ' %';
		$stmt->bind_param("is", $raw['region_id'], $tmp);
		$stmt->execute();
		$stmt->bind_result($res);
		$stmt->fetch();
		$stmt->close();
		if($res)
			$raw['region_id'] = $res;
		else{
			$stmt = $db->prepare('INSERT INTO dic_region (parent_id, title) VALUES (?, ?)');
			$tmp = $raw['uyezd'] . ' ';
			$stmt->bind_param("is", $raw['region_id'], $tmp);
			$stmt->execute();
			$stmt->close();
			$raw['region_id'] = $db->insert_id;
		}
	}

	// Расшифровываем даты
	prepublish_date($raw, $date_norm);

	// Собираем данные для занесения в основную таблицу
if(defined('P_DEBUG'))	var_export($raw);
	return prepublish_make_data($raw, $have_trouble);
} // function prepublish



/**
 * Функция подготовки данных для занесения в систему
 */
function prepublish_make_data($raw_norm, &$have_trouble){
	$have_trouble = false;
	$pub = array();
	foreach(explode(' ', 'id surname name rank religion_id marital_id region_id place reason_id date date_from date_to source_id list_nr list_pg') as $key){
		if(!isset($raw_norm[$key])
		|| (empty($raw_norm[$key]) && $key != 'source_id' && preg_match('/_id$/uS', $key)))
			$have_trouble = true;
		else
			$pub[$key] = $raw_norm[$key];
	}
	return $pub;
}

?>