Repository: Limych/GeniBase
Catalog: src/gb-admin/languages/*.po
Languages: ru

source: My Site
ru: Мой сайт

source: j F Y
ru: d.m.Y

source: G:i
ru: H:i

# User role
source: Administrator
ru: Администратор

# User role
source: Moderator
ru: Модератор

# User role
source: Editor
ru: Редактор

# User role
source: Contributor
ru: Помощник

# User role
source: Reader
ru: Читатель

source: <strong><em>Note that password</em></strong> carefully! It is a <em>random</em> password that was generated just for you.
ru: <strong><em>Запишите этот пароль</em></strong> аккуратно! Это <em>случайный</em> пароль, который был создан специально для вас.

source: Your chosen password.
ru: Указанный вами пароль.

source: User already exists. Password inherited.
ru: Пользователь уже существует. Сохранён старый пароль.

source: The password you chose during the install.
ru: Пароль, который вы выбрали при установке системы.

source: Your new GeniBase site has been successfully set up at: %1$s You can log in to the administrator account with the following information: User login: %2$s Password: %3$s Log in here: %4$s We hope you enjoy your new site. Thanks! --The GeniBase Team
ru: Ваш новый сайт на базе GeniBase успешно установлен по адресу: %1$s Вы можете авторизоваться как администратор, используя следующую информацию: Имя пользователя: %2$s Пароль: %3$s Авторизуйтесь здесь: %4$s Мы надеемся, вам понравится ваш новый сайт. Спасибо! -- Команда разработчиков GeniBase

source: New GeniBase Site
ru: Новый сайт на GeniBase

source: GeniBase Installation
ru: Инсталляция GeniBase

source: Site Title
ru: Название сайта

source: Your E-mail
ru: Ваш e-mail

source: User(s) already exists.
ru: Пользователь(и) уже существует.

source: Double-check your email address before continuing.
ru: Дважды проверьте адрес почты, прежде чем продолжать.

source: Password, twice
ru: Пароль, дважды

source: Strength indicator
ru: Индикатор надёжности

source: A&nbsp;password will be automatically generated for you if you leave this blank.
ru: Если вы оставите эти поля пустыми, пароль для вас будет создан автоматически.

source: Privacy
ru: Приватность

source: Allow search engines to&nbsp;index this site.
ru: Разрешить поисковым системам индексировать ваш сайт.

source: Install GeniBase
ru: Установить GeniBase

# Howdy
source: Welcome
ru: Добро пожаловать

source: Welcome to five-minute GeniBase installation process! Just fill in the information below.
ru: Добро пожаловать в пятиминутный процесс инсталляции GeniBase! Просто заполните поля ниже.

source: Information needed
ru: Необходимая информация

source: Please provide the following information. Don&#8217;t worry, you can always change these settings later.
ru: Пожалуста, укажите следующие данные. Вы всегда сможете изменить эти настройки позже.

source: You must provide an email address.
ru: Необходимо указать адрес электронной почты.

source: Sorry, that isn&#8217;t a valid email address. Email addresses look like <code>username@example.com</code>.
ru: Извините, но это не адрес электронной почты. Адрес должен быть похожим на <code>username@example.com</code>.

source: Your passwords do not match. Please try again.
ru: Введённые вами пароли не совпадают. Попробуйте ещё раз.

source: Success!
ru: Поздравляем!

source: GeniBase has been installed. Were you expecting more steps? Sorry to disappoint.
ru: GeniBase установлена. Вы ожидали, что шагов будет больше? Извините за неудобство.

source: User login
ru: Имя пользователя

source: Password
ru: Пароль

source: Log In
ru: Авторизоваться

source: Sorry, I need a <code>gb-config-sample.php</code> file to work from. Please re-upload this file from your GeniBase installation.
ru: Извините, но для работы нужен файл <code>gb-config-sample.php</code>. Пожалуйста, загрузите его заново из инсталляционного пакета GeniBase.

source: The file <code>gb-config.php</code> already exists. If you need to reset any of the configuration items in this file, please delete it first. You may try <a href='%s'>installing now</a>.
ru: Файл <code>gb-config.php</code> уже существует. Если вы хотите переустановить какие-либо настройки в нём, пожалуйста, сперва удалите его. Или вы можете <a href='%s'>перейти к инсталляции</a>.

source: The file <code>gb-config.php</code> already exists one level above your GeniBase installation. If you need to reset any of the configuration items in this file, please delete it first. You may try <a href='%s'>installing now</a>.
ru: Файл <code>gb-config.php</code> уже существует в каталоге на один уровень выше инсталляции GeniBase. Если вы хотите переустановить какие-либо настройки в нём, пожалуйста, сперва удалите его. Или вы можете <a href='%s'>перейти к инсталляции</a>.

source: GeniBase &rsaquo; Setup Configuration File
ru: GeniBase &rsaquo; Создание файла настроек

source: Welcome to GeniBase. Before getting started, we need some information on the database. You will need to know the following items before proceeding.
ru: Добро пожаловать в GeniBase. Прежде всего нам нужна некоторая информация о базе данных. Вам необходимо знать следующие данные для начала работы.

source: Database host
ru: Адрес сервера базы данных

source: Database username
ru: Логин к базе данных

source: Database password
ru: Пароль к базе данных

source: Database name
ru: Имя базы данных

source: We&#8217;re going to use this information to create a <code>gb-config.php</code> file.
ru: Мы используем эту информацию для создания файла <code>gb-config.php</code>.

source: If for any reason this automatic file creation doesn&#8217;t work, don&#8217;t worry. All this does is fill in the database information to a configuration file. You may also simply open <code>gb-config-sample.php</code> in a text editor, fill in your information, and save it as <code>gb-config.php</code>.
ru: Если по какой-то причине автоматическое создание этого файла не сработает, не волнуйтесь. Вы всегда можете открыть в текстовом редакторе файл <code>gb-config-sample.php</code>, заполнить необходимую информацию вручную и сохранить его как <code>gb-config.php</code>.

source: In all likelihood, these items were supplied to you by your Web Host. If you do not have this information, then you will need to contact them before you can continue. If you&#8217;re all ready&hellip;
ru: По всей видимости, вся эта информация должна уже быть предоставлена вам вашим провайдером. Если вы не имеете этих данных, вам необходимо связаться с провайдером прежде, чем продолжить. Если же вы готовы&hellip;

source: Let&#8217;s go!
ru: Поехали!

source: Below you should enter your database connection details. If you&#8217;re not sure about these, contact your host.
ru: Ниже вам необходимо указать ваши настройки для подключения к базе данных. Если вы не уверены в них, свяжитесь со своим провайдером.

source: You should be able to get this info from your web host, if <code>localhost</code> does not work.
ru: Вам необходимо получить эту информацию от провайдера, если значение <code>localhost</code> не работает.

source: User Name
ru: Имя пользователя

source: Your MySQL username
ru: Ваш логин к серверу MySQL

source: &hellip; and your MySQL password.
ru: &hellip; и пароль к нему.

source: The name of the database you want to run GeniBase in.
ru: Имя базы данных, в которой вы хотите запустить систему GeniBase.

source: Table Prefix
ru: Префикс таблиц

source: If you want to run multiple GeniBase installations in a single database or for security reasons, change this. For example, to &#8220;<code>%s</code>&#8221;.
ru: Если вы хотите запустить несколько версий GeniBase в одной базе данных, либо хотите увеличить надёжность системы от взлома, измените это значение. Например, на &#8220;<code>%s</code>&#8221;.

source: Submit
ru: Отправить

source: Try again
ru: Попробовать снова

source: <strong>ERROR</strong>: &#8220;Table Prefix&#8221; must not be empty.
ru: <strong>ОШИБКА</strong>: Поле &laquo;Префикс таблиц&raquo; не должно быть пустым.

source: <strong>ERROR</strong>: &#8220;Table Prefix&#8221; can only contain numbers, letters, and underscores.
ru: <strong>ОШИБКА</strong>: Поле &laquo;Префикс таблиц&raquo; может содержать только цифры, латинские буквы и знаки подчёркивания.

source: Sorry, but I can&#8217;t write the <code>gb-config.php</code> file.
ru: К сожалению, не получается записать файл <code>gb-config.php</code>.

source: You can create the <code>gb-config.php</code> manually and paste the following text into it:
ru: Вы можете создать файл <code>gb-config.php</code> вручную и скопировать в него следующий код:

source: After you&#8217;ve done that, click &#8220;Run the install.&#8221;
ru: После того, как вы это сделаете, нажмите &laquo;Запустить инсталляцию&raquo;

source: Run the install
ru: Запустить инсталляцию

source: All right, sparky! You&#8217;ve made it through this part of the installation. GeniBase can now communicate with your database. If you are ready, time now to&hellip;
ru: Замечательно! Вы прошли через этот этап установки системы. Теперь GeniBase может подключиться к серверу баз данных. Если вы готовы, пришло время&hellip;
