Repository: Limych/GeniBase
Catalog: src/languages/*.po
Languages: ru_ru

# Field name
source: Surname
ru_ru: Фамилия

# Field name
source: Other names
ru_ru: Имя, Отчество

# Field name
source: Place of residence
ru_ru: Место жительства

# Field name
source: Military rank
ru_ru: Воинское звание

# Field name
source: Religion
ru_ru: Вероисповедание

# Field name
source: Marital status
ru_ru: Семейное положение

# Field name
source: Province, Uezd, Volost
ru_ru: Губерния, Уезд, Волость

# Field name
source: Volost/Place
ru_ru: Волость/Нас.пункт

# Field name
source: Event
ru_ru: Событие

# Field name
source: Event date
ru_ru: Дата события

# Field name
source: Source type
ru_ru: Тип источника

# Field name
source: Source number
ru_ru: Номер источника

# Field name
source: Source page
ru_ru: Стр. источника

# Field name
source: Record ID
ru_ru: ID записи

source: also search for similar surnames
ru_ru: также искать похожие фамилии

source: also search for abbreviations of names
ru_ru: также искать сокращения имён

# Date from … to …
source: from
ru_ru: с

# Date from … to …
source: to
ru_ru: по

# Table header “Item number”
source: No.
ru_ru: № <nobr>п/п</nobr>

source: (surname is not&nbsp;specified)
ru_ru: (фамилия не&nbsp;указана)

source: (name is not&nbsp;specified)
ru_ru: (имя не&nbsp;указано)

source: (not&nbsp;specified)
ru_ru: (не&nbsp;указано)

source: <a href="%1$s" target="_blank">“%2$s”</a>, pg.%3$s
ru_ru: <a href="%1$s" target="_blank">«%2$s»</a>, стр.%3$s

source: “%1$s”, pg.%2$s
ru_ru: «%1$s», стр.%2$s

source: “%s”
ru_ru: «%1$s»

source: By clicking on the line that you are interested in, you will see an additional information.
ru_ru: По клику на строке интересной Вам записи открывается дополнительная информация.

source: You can navigate through the pages of search results by using the keys <span class="kbdKey">Ctrl</span>+<span class="kbdKey">→</span> and <span class="kbdKey">Ctrl</span>+<span class="kbdKey">←</span>
ru_ru: Вы можете перемещаться по страницам результатов поиска, используя клавиши <span class="kbdKey">Ctrl</span>+<span class="kbdKey">→</span> и <span class="kbdKey">Ctrl</span>+<span class="kbdKey">←</span>.

source: Many records have links to electronic copies of sources on which the database is created.
ru_ru: Многие записи снабжены ссылками на электронные копии источников, по которым создавалась эта база данных.

source: Usually when searching system automatically searches for similar-sounding names or spelling variations. All of these findings are displayed at the end of the list and highlighted.
ru_ru: Обычно при поиске система автоматически ищет близкие по звучанию или написанию варианты фамилий. Все такие находки показываются в конце списка и выделяются цветом.

source: Please note:
ru_ru: Обратите внимание:

source: Found %s record.
ru_ru: Найдена %s запись.

source: Unfortunately, nothing found.
ru_ru: Увы, ничего не найдено.

source: What to do now?
ru_ru: Что же теперь делать?

source: Try to search for different spellings for names and places.
ru_ru: Попробуйте разные близкие варианты написания имён, фамилий, мест.

source: The lists initially were handwritten. In situation of war. Some of them are made by not very literate clerks. The various errors could been added during their writing, printing in typography and during modern digitizing by volunteers;
ru_ru: Изначально списки писались от-руки в&nbsp;условиях войны и&nbsp;не&nbsp;всегда очень грамотными писарями. Во&nbsp;время их написания, набора в&nbsp;типографии и&nbsp;во&nbsp;время оцифровки их волонтёрами могли закрасться различные ошибки;

source: Remove one search criteria and repeat search.
ru_ru: Повторить поиск, исключив один из&nbsp;критериев.

source: Perhaps, some information not to added to database completely by some reason;
ru_ru: Возможно, искомые Вами данные по&nbsp;какой-то причине занесены в&nbsp;систему не&nbsp;полностью;

source: Wait for one-two weeks and repeat you search.
ru_ru: Подождите неделю-другую и повторите поиск.

source: Our database is constantly updated with new materials. Perhaps, we will add information that you search;
ru_ru: Система постоянно пополняется новыми материалами и, возможно, необходимая Вам информация будет добавлена в&nbsp;неё через некоторое время.

source: Project crew
ru_ru: Команда проекта

source: &laquo;&nbsp;Back to search
ru_ru: &laquo;&nbsp;Назад к&nbsp;поиску

source: Project management
ru_ru: Руководство проектом

source: Preparation of electronic version of the lists
ru_ru: Подготовка электронных версий списков

source: Programming
ru_ru: Программирование

source: Do you want to <a href="%s" target="_blank">join us? Welcome!</a>
ru_ru: Хотите <a href="%s" target="_blank">присоединиться к проекту? Добро пожаловать!</a>

source: Search person
ru_ru: Поиск персоны

source: Search “%s”
ru_ru: Поиск «%s»

source: Advanced search person
ru_ru: Расширенный поиск

source: Search instruction
ru_ru: Инструкции по поиску

source: Simple search
ru_ru: Упрощённый поиск

# Button name
source: Search
ru_ru: Искать

source: The searching by surname process can be automatically expanded with using the similar surnames. The lists of persons were initially handwritten, and written as it was heard, therefore the same surname in the lists can be put differently.
ru_ru: Поиск по фамилиям может автоматически искать близкие фамилии. Изначально списки были рукописными и часто писались «со слов», потому одна и та же фамилия может в списках быть записана очень по-разному.

source: The searching by name process can be automatically expanded with using the name common abbreviations and shortcuts. Partial matches are displayed at the end of the list and highlighted by color.
ru_ru: Поиск по именам может автоматически добавлять в результаты наиболее часто встречающиеся варианты сокращённых записей имени и/или отчества. Неполные совпадения выводятся в конце списка и выделяются цветом.

source: In every text fields you can use wildcard characters: “?” (question)&nbsp;&mdash; matches any single character, “*” (asterisk)&nbsp;&mdash; matches a one or more characters of any kind. If you use wildcard characters, automatic expanding of the search does not work.
ru_ru: Во всех текстовых полях можно использовать метасимволы: «?» (вопрос)&nbsp;&mdash; заменяет один любой символ, «*» (звёздочка)&nbsp;&mdash; заменяет один и более любых символов. При использовании метасимволов фонетический поиск и расширение поиска не действуют.

source: If you do not have Russian keyboard, you can type text in transliteration&nbsp;&mdash; it will be automatically encoded in Russian letters. <a href="%s">See the conversion table.</a>
ru_ru: Если у&nbsp;вас нет русской клавиатуры, вы&nbsp;можете набирать текст в&nbsp;транслите&nbsp;&mdash; он&nbsp;будет автоматически перекодирован в&nbsp;русские буквы. <a href="%s">См. таблицу перекодировки.</a>

source: In the lists you can select or deselect several values. To do this, click the mouse while holding down “Ctrl” key (“Command” key for Mac).
ru_ru: В списках можно выбирать или отменять выбор по нескольку значений. Для этого кликайте мышью держа зажатой клавишу «Ctrl» («Command» для Mac).

source: In the fields “Source number”, “Source page” and “Record ID” you can list several values separated by commas or spaces.
ru_ru: В полях «Номер источника», «Страница источника» и «ID записи» можно перечислять по нескольку значений через запятую или пробел.

# Field name
source: Military unit
ru_ru: Место службы

# Field name
source: Place of event
ru_ru: Место события

# Field name
source: Title/Class
ru_ru: Титул/Сословие

# Field name
source: Additional info
ru_ru: Доп. информация

# Field name
source: Birthdate
ru_ru: Дата рождения

# Field name
source: Source
ru_ru: Источник

# HTML-page title
source: The First World War, 1914&ndash;1918
ru_ru: Первая мировая война, 1914&ndash;1918 гг.

# Project title in header
source: The First World War, <nobr>1914&ndash;1918</nobr>
ru_ru: Первая мировая война, <nobr>1914&ndash;1918 гг.</nobr>

source: The project of Union of Revival of Pedigree Traditions
ru_ru: Проект Союза Возрождений Родословных Традиций (СВРТ)

source: Statistic
ru_ru: Статистика

source: Guestbook
ru_ru: Гостевая книга

source: Discussion about the project
ru_ru: Обсуждение проекта

source: This lists are placed in the public domain for non-commercial research only. The use of this lists for commercial purposes without the express consent of the lists owners and the project participants is prohibited.
ru_ru: Обработанные списки размещаются в свободном доступе только для некоммерческих исследований. Использование обработанных списков в коммерческих целях запрещено без получения Вами явного согласия правообладателя источника информации, СВРТ и участников проекта, осуществлявших обработку и систематизацию списков.

source: Currently the database contains %s record.
ru_ru: На&nbsp;данный момент в&nbsp;базе содержится %s запись.

source: Of these, %s record is now available for search.
ru_ru: Из них %s запись доступна для поиска.

source: You are overload the database and have been blocked for some time. Please, take a break...
ru_ru: Вы перегружаете систему и&nbsp;были заблокированы на&nbsp;некоторое время. Сделайте перерыв…

source: Advanced search
ru_ru: Расширенный поиск

source: The system automatically trying to expand your request, in view of possible errors in spelling and abbreviations of names. Partial matches are displayed at the end of the list and highlighted by color.
ru_ru: Система автоматически пытается расширить Ваш запрос с&nbsp;учётом возможных ошибок и&nbsp;сокращений в&nbsp;написании имён и&nbsp;фамилий. Неполные совпадения выводятся в&nbsp;конце списка и&nbsp;выделяются цветом.

source: <strong>Please note:</strong> during the First World War there were no modern republics and regions&nbsp;&mdash; were provinces and districts of the Russian Empire, the boundaries of which are often different from the boundaries of the modern territores. Place names are indicated as of the date of the war.
ru_ru: <strong>Обратите внимание:</strong> во&nbsp;времена Первой мировой войны не&nbsp;было современных республик и&nbsp;областей&nbsp;&mdash; были губернии и&nbsp;уезды Российской Империи, границы которых часто отличаются от&nbsp;границ современных территорий. Названия мест указываются по&nbsp;состоянию на&nbsp;даты войны.

# Field name
source: Province, Uezd, Volost, Place
ru_ru: Губерния, Уезд, Волость, Нас.пункт

source: Some last search queries:
ru_ru: Некоторые последние поисковые запросы:

source: Common database statistic
ru_ru: Общая статистика по базе данных

source: Distribution by regions of Russian Empire
ru_ru: Распределение по регионам Российской Империи

# Field name
source: Province, Uezd
ru_ru: Губерния, Уезд

source: Records count
ru_ru: Записей

source: Distribution by military rank
ru_ru: Распределение по воинским званиям

source: Distribution by events
ru_ru: Распределение по событиям

# Field name
source: Event type
ru_ru: Тип события

source: Distribution by religion
ru_ru: Распределение по вероисповеданиям

source: Distribution by marital status
ru_ru: Распределение по семейному положению
